In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

### Extract CSVs into DataFrames

In [3]:
first_file = "*"
first_df = pd.read_csv(first_file)
first_df.head()

,License Serial Number,Premises Name,License Certificate Number,License Received Date,County ID Code
0,1311660,CANA ARRIBA GROCERY NO 2 INC,NaN,2018-06-29T00:00:00,0
1,1310023,JOHANA GROCERY & DELI CORP,NaN,2018-04-27T00:00:00,0
2,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
3,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
4,1311663,181 LEXINGTON AVENUE BBQ LLC,NaN,2018-06-29T00:00:00,2

In [5]:
second_file = "*"
second_df = pd.read_csv(second_file)
second_df.head()

   ID County Name (Licensee)  County ID Code  License Count
0   0                 ALBANY               5             77
1   1               ALLEGANY              59              4
2   2                  BRONX               0            104
3   3                 BROOME              35             14
4   4            CATTARAUGUS              41              9

In [10]:
def transform(dataframe, columns, rename_dict):
    dataframe_transformed = dataframe[columns]
    dataframe_transformed = dataframe_transformed.rename(columns=rename_dict)
    dataframe_transformed.drop_duplicates("id", inplace=True)
    dataframe_transformed.set_index("id", inplace=True)
    print(dataframe_transformed.head())
    return dataframe_transformed

### Transform premise DataFrame

In [11]:
premise_cols = ["License Serial Number", "Premises Name", "County ID Code"]
premise_cols_rename = {
    "License Serial Number": "id",
    "Premises Name": "premise_name",
    "County ID Code": "county_id"
}

# premise_transform_df = premise_df[premise_cols]
# premise_transform_df = premise_transform_df.rename(columns=premise_cols_rename)
# premise_transform_df.drop_duplicates("id", inplace=True)
# premise_transform_df.set_index("id", inplace=True)
# premise_transform_df.head()
premise_transform_df = transform(premise_df, premise_cols, premise_cols_rename)

                         premise_name  county_id
id
1311660  CANA ARRIBA GROCERY NO 2 INC          0
1310023    JOHANA GROCERY & DELI CORP          0
1310024             TKO BEVERAGES LLC          1
1311663  181 LEXINGTON AVENUE BBQ LLC          2
1310029        AZIZ DELI & GRILL CORP          1

In [12]:
premise_transform_df.head()

                         premise_name  county_id
id
1311660  CANA ARRIBA GROCERY NO 2 INC          0
1310023    JOHANA GROCERY & DELI CORP          0
1310024             TKO BEVERAGES LLC          1
1311663  181 LEXINGTON AVENUE BBQ LLC          2
1310029        AZIZ DELI & GRILL CORP          1

### Transform county DataFrame

In [13]:
county_cols = ["ID", "County Name (Licensee)", "County ID Code", "License Count"]
county_rename_col = {"ID": "id",
                 "County Name (Licensee)": "county_name",
                 "License Count": "license_count",
                 "County ID Code": "county_id"}
county_transform_df = transform(county_df, county_cols, county_rename_col)

    county_name  county_id  license_count
id
0        ALBANY          5             77
1      ALLEGANY         59              4
2         BRONX          0            104
3        BROOME         35             14
4   CATTARAUGUS         41              9

In [14]:
county_transform_df.head()

    county_name  county_id  license_count
id
0        ALBANY          5             77
1      ALLEGANY         59              4
2         BRONX          0            104
3        BROOME         35             14
4   CATTARAUGUS         41              9

### Create database connection

In [15]:
rds_connection_string = "root:root@127.0.0.1/customer_db"
engine = create_engine(f'mysql://{rds_connection_string}')

In [16]:
# Confirm tables
engine.table_names()

['county', 'customer_location', 'customer_name', 'premise']

### Load DataFrames into database

In [17]:
premise_transform_df.to_sql("premise", con=engine, if_exists='append', index=True)

In [18]:
county_transform_df.to_sql("county", con=engine, if_exists='append', index=True)